espressif/esp-idf/components/soc/esp32p4/include/soc/mcpwm_struct.h
/** Type of gen_tstmp_a register
 *  Generator$n time stamp A's shadow register
 */
typedef union {
    struct {
        /** cmpr : R/W; bitpos: [15:0]; default: 0;
         *  Configures the value of PWM generator $n time stamp 's shadow register.
         */
        uint32_t cmpr:16;
        uint32_t reserved_16:16;
    };
    uint32_t val;
} mcpwm_gen_tstmp_reg_t;


/** Type of gen_cfg0 register
 *  Generator$n fault event T0 and T1 configuration register
 */
typedef union {
    struct {
        /** gen_cfg_upmethod : R/W; bitpos: [3:0]; default: 0;
         *  Configures update method for PWM generator $n's active register.\\0:
         *  Immediately\\Bit0 is set to 1: TEZ\\Bit1 is set to 1: TEP\\Bit2 is set to 1:
         *  Sync\\Bit3 is set to 1: Disable the update
         */
        uint32_t gen_cfg_upmethod:4;
        /** gen_t0_sel : R/W; bitpos: [6:4]; default: 0;
         *  Configures source selection for PWM generator $n event_t0, take effect
         *  immediately.\\0: fault_event0\\1: fault_event1\\2: fault_event2\\3: sync_taken\\4:
         *  Invalid, Select nothing
         */
        uint32_t gen_t0_sel:3;
        /** gen_t1_sel : R/W; bitpos: [9:7]; default: 0;
         *  Configures source selection for PWM generator $n event_t1, take effect
         *  immediately.\\0: fault_event0\\1: fault_event1\\2: fault_event2\\3: sync_taken\\4:
         *  Invalid, Select nothing
         */
        uint32_t gen_t1_sel:3;
        uint32_t reserved_10:22;
    };
    uint32_t val;
} mcpwm_gen_cfg0_reg_t;

/** Type of gen_force register
 *  Generator$n output signal force mode register.
 */
typedef union {
    struct {
        /** gen_cntuforce_upmethod : R/W; bitpos: [5:0]; default: 32;
         *  Configures update method for continuous software force of PWM generator$n.\\0:
         *  Immediately\\Bit0 is set to 1: TEZ\\Bit1 is set to 1: TEP\\Bit2 is set to 1:
         *  TEA\\Bit3 is set to 1: TEB\\Bit4 is set to 1: Sync\\Bit5 is set to 1: Disable
         *  update. TEA/B here and below means an event generated when the timer's value equals
         *  to that of register A/B.
         */
        uint32_t gen_cntuforce_upmethod:6;
        /** gen_a_cntuforce_mode : R/W; bitpos: [7:6]; default: 0;
         *  Configures continuous software force mode for PWM$n A.\\0: Disabled\\1: Low\\2:
         *  High\\3: Disabled
         */
        uint32_t gen_a_cntuforce_mode:2;
        /** gen_b_cntuforce_mode : R/W; bitpos: [9:8]; default: 0;
         *  Configures continuous software force mode for PWM$n B.\\0: Disabled\\1: Low\\2:
         *  High\\3: Disabled
         */
        uint32_t gen_b_cntuforce_mode:2;
        /** gen_a_nciforce : R/W; bitpos: [10]; default: 0;
         *  Configures the generation of non-continuous immediate software-force event for
         *  PWM$n A, a toggle will trigger a force event.
         */
        uint32_t gen_a_nciforce:1;
        /** gen_a_nciforce_mode : R/W; bitpos: [12:11]; default: 0;
         *  Configures non-continuous immediate software force mode for PWM$n A.\\0:
         *  Disabled\\1: Low\\2: High\\3: Disabled
         */
        uint32_t gen_a_nciforce_mode:2;
        /** gen_b_nciforce : R/W; bitpos: [13]; default: 0;
         *  Configures the generation of non-continuous immediate software-force event for
         *  PWM$n B, a toggle will trigger a force event.
         */
        uint32_t gen_b_nciforce:1;
        /** gen_b_nciforce_mode : R/W; bitpos: [15:14]; default: 0;
         *  Configures non-continuous immediate software force mode for PWM$n B.\\0:
         *  Disabled\\1: Low\\2: High\\3: Disabled
         */
        uint32_t gen_b_nciforce_mode:2;
        uint32_t reserved_16:16;
    };
    uint32_t val;
} mcpwm_gen_force_reg_t;

/** Type of gen register
 *  PWM$n output signal A actions configuration register
 */
typedef union {
    struct {
        /** gen_a_utez : R/W; bitpos: [1:0]; default: 0;
         *  Configures action on PWM$n A triggered by event TEZ when timer increasing.\\0: No
         *  change\\1: Low\\2: High\\3: Toggle
         */
        uint32_t gen_utez:2;
        /** gen_a_utep : R/W; bitpos: [3:2]; default: 0;
         *  Configures action on PWM$n A triggered by event TEP when timer increasing.\\0: No
         *  change\\1: Low\\2: High\\3: Toggle
         */
        uint32_t gen_utep:2;
        /** gen_a_utea : R/W; bitpos: [5:4]; default: 0;
         *  Configures action on PWM$n A triggered by event TEA when timer increasing.\\0: No
         *  change\\1: Low\\2: High\\3: Toggle
         */
        uint32_t gen_utea:2;
        /** gen_a_uteb : R/W; bitpos: [7:6]; default: 0;
         *  Configures action on PWM$n A triggered by event TEB when timer increasing.\\0: No
         *  change\\1: Low\\2: High\\3: Toggle
         */
        uint32_t gen_uteb:2;
        /** gen_a_ut0 : R/W; bitpos: [9:8]; default: 0;
         *  Configures action on PWM$n A triggered by event_t0 when timer increasing.\\0: No
         *  change\\1: Low\\2: High\\3: Toggle
         */
        uint32_t gen_ut0:2;
        /** gen_a_ut1 : R/W; bitpos: [11:10]; default: 0;
         *  Configures action on PWM$n A triggered by event_t1 when timer increasing.\\0: No
         *  change\\1: Low\\2: High\\3: Toggle
         */
        uint32_t gen_ut1:2;
        /** gen_a_dtez : R/W; bitpos: [13:12]; default: 0;
         *  Configures action on PWM$n A triggered by event TEZ when timer decreasing.\\0: No
         *  change\\1: Low\\2: High\\3: Toggle
         */
        uint32_t gen_dtez:2;
        /** gen_a_dtep : R/W; bitpos: [15:14]; default: 0;
         *  Configures action on PWM$n A triggered by event TEP when timer decreasing.\\0: No
         *  change\\1: Low\\2: High\\3: Toggle
         */
        uint32_t gen_dtep:2;
        /** gen_a_dtea : R/W; bitpos: [17:16]; default: 0;
         *  Configures action on PWM$n A triggered by event TEA when timer decreasing.\\0: No
         *  change\\1: Low\\2: High\\3: Toggle
         */
        uint32_t gen_dtea:2;
        /** gen_a_dteb : R/W; bitpos: [19:18]; default: 0;
         *  Configures action on PWM$n A triggered by event TEB when timer decreasing.\\0: No
         *  change\\1: Low\\2: High\\3: Toggle
         */
        uint32_t gen_dteb:2;
        /** gen_a_dt0 : R/W; bitpos: [21:20]; default: 0;
         *  Configures action on PWM$n A triggered by event_t0 when timer decreasing.\\0: No
         *  change\\1: Low\\2: High\\3: Toggle
         */
        uint32_t gen_dt0:2;
        /** gen_a_dt1 : R/W; bitpos: [23:22]; default: 0;
         *  Configures action on PWM$n A triggered by event_t1 when timer decreasing.\\0: No
         *  change\\1: Low\\2: High\\3: Toggle
         */
        uint32_t gen_dt1:2;
        uint32_t reserved_24:8;
    };
    uint32_t val;
} mcpwm_gen_reg_t;

/** Type of dt0_cfg register
 *  Dead time configuration register
 */
typedef union {
    struct {
        /** db_fed_upmethod : R/W; bitpos: [3:0]; default: 0;
         *  Configures update method for FED (Falling edge delay) active register.\\0:
         *  Immediate\\Bit0 is set to 1: TEZ\\Bit1 is set to 1: TEP\\Bit2 is set to 1:
         *  Sync\\Bit3 is set to 1: Disable the update
         */
        uint32_t db_fed_upmethod:4;
        /** db_red_upmethod : R/W; bitpos: [7:4]; default: 0;
         *  Configures update method for RED (rising edge delay) active register.\\0:
         *  Immediate\\Bit0 is set to 1: TEZ\\Bit1 is set to 1: TEP\\Bit2 is set to 1:
         *  Sync\\Bit3 is set to 1: Disable the update
         */
        uint32_t db_red_upmethod:4;
        /** db_deb_mode : R/W; bitpos: [8]; default: 0;
         *  Configures S8 in table, dual-edge B mode.\\0: fed/red take effect on different path
         *  separately\\1: fed/red take effect on B path, A out is in bypass or dulpB mode
         */
        uint32_t db_deb_mode:1;
        /** db_a_outswap : R/W; bitpos: [9]; default: 0;
         *  Configures S6 in table.
         */
        uint32_t db_a_outswap:1;
        /** db_b_outswap : R/W; bitpos: [10]; default: 0;
         *  Configures S7 in table.
         */
        uint32_t db_b_outswap:1;
        /** db_red_insel : R/W; bitpos: [11]; default: 0;
         *  Configures S4 in table.
         */
        uint32_t db_red_insel:1;
        /** db_fed_insel : R/W; bitpos: [12]; default: 0;
         *  Configures S5 in table.
         */
        uint32_t db_fed_insel:1;
        /** db_red_outinvert : R/W; bitpos: [13]; default: 0;
         *  Configures S2 in table.
         */
        uint32_t db_red_outinvert:1;
        /** db_fed_outinvert : R/W; bitpos: [14]; default: 0;
         *  Configures S3 in table.
         */
        uint32_t db_fed_outinvert:1;
        /** db_a_outbypass : R/W; bitpos: [15]; default: 1;
         *  Configures S1 in table.
         */
        uint32_t db_a_outbypass:1;
        /** db_b_outbypass : R/W; bitpos: [16]; default: 1;
         *  Configures S0 in table.
         */
        uint32_t db_b_outbypass:1;
        /** db_clk_sel : R/W; bitpos: [17]; default: 0;
         *  Configures dead time generator $n clock selection.\\0: PWM_clk\\1: PT_clk
         */
        uint32_t db_clk_sel:1;
        uint32_t reserved_18:14;
    };
    uint32_t val;
} mcpwm_dt_cfg_reg_t;

/** Type of dt0_fed_cfg register
 *  Falling edge delay (FED) shadow register
 */
typedef union {
    struct {
        /** db_fed : R/W; bitpos: [15:0]; default: 0;
         *  Configures shadow register for FED.
         */
        uint32_t db_fed:16;
        uint32_t reserved_16:16;
    };
    uint32_t val;
} mcpwm_dt_fed_cfg_reg_t;

/** Type of dt0_red_cfg register
 *  Rising edge delay (RED) shadow register
 */
typedef union {
    struct {
        /** db_red : R/W; bitpos: [15:0]; default: 0;
         *  Configures shadow register for RED.
         */
        uint32_t db_red:16;
        uint32_t reserved_16:16;
    };
    uint32_t val;
} mcpwm_dt_red_cfg_reg_t;

/** Type of carrier0_cfg register
 *  Carrier$n configuration register
 */
typedef union {
    struct {
        /** chopper_en : R/W; bitpos: [0]; default: 0;
         *  Configures whether or not to enable carrier$n.\\0: Bypassed\\1: Enabled
         */
        uint32_t chopper_en:1;
        /** chopper_prescale : R/W; bitpos: [4:1]; default: 0;
         *  Configures the prescale value of PWM carrier$n clock (PC_clk), so that period of
         *  PC_clk = period of PWM_clk * (PWM_CARRIER$n_PRESCALE + 1)
         */
        uint32_t chopper_prescale:4;
        /** chopper_duty : R/W; bitpos: [7:5]; default: 0;
         *  Configures carrier duty. Duty = PWM_CARRIER$n_DUTY / 8
         */
        uint32_t chopper_duty:3;
        /** chopper_oshtwth : R/W; bitpos: [11:8]; default: 0;
         *  Configures width of the first pulse. Measurement unit: Periods of the carrier.
         */
        uint32_t chopper_oshtwth:4;
        /** chopper_out_invert : R/W; bitpos: [12]; default: 0;
         *  Configures whether or not to invert the output of PWM$n A and PWM$n B for this
         *  submodule.\\0: Normal\\1: Invert
         */
        uint32_t chopper_out_invert:1;
        /** chopper_in_invert : R/W; bitpos: [13]; default: 0;
         *  Configures whether or not to invert the input of PWM$n A and PWM$n B for this
         *  submodule.\\0: Normal\\1: Invert
         */
        uint32_t chopper_in_invert:1;
        uint32_t reserved_14:18;
    };
    uint32_t val;
} mcpwm_carrier_cfg_reg_t;

/** Type of fh0_cfg0 register
 *  PWM$n A and PWM$n B trip events actions configuration register
 */
typedef union {
    struct {
        /** tz_sw_cbc : R/W; bitpos: [0]; default: 0;
         *  Configures whether or not to enable software force cycle-by-cycle mode action.\\0:
         *  Disable\\1: Enable
         */
        uint32_t tz_sw_cbc:1;
        /** tz_f2_cbc : R/W; bitpos: [1]; default: 0;
         *  Configures whether or not event_f2 will trigger cycle-by-cycle mode action.\\0:
         *  Disable\\1: Enable
         */
        uint32_t tz_f2_cbc:1;
        /** tz_f1_cbc : R/W; bitpos: [2]; default: 0;
         *  Configures whether or not event_f1 will trigger cycle-by-cycle mode action.\\0:
         *  Disable\\1: Enable
         */
        uint32_t tz_f1_cbc:1;
        /** tz_f0_cbc : R/W; bitpos: [3]; default: 0;
         *  Configures whether or not event_f0 will trigger cycle-by-cycle mode action.\\0:
         *  Disable\\1: Enable
         */
        uint32_t tz_f0_cbc:1;
        /** tz_sw_ost : R/W; bitpos: [4]; default: 0;
         *  Configures whether or not to enable software force one-shot mode action.\\0:
         *  Disable\\1: Enable
         */
        uint32_t tz_sw_ost:1;
        /** tz_f2_ost : R/W; bitpos: [5]; default: 0;
         *  Configures whether or not event_f2 will trigger one-shot mode action.\\0:
         *  Disable\\1: Enable
         */
        uint32_t tz_f2_ost:1;
        /** tz_f1_ost : R/W; bitpos: [6]; default: 0;
         *  Configures whether or not event_f1 will trigger one-shot mode action.\\0:
         *  Disable\\1: Enable
         */
        uint32_t tz_f1_ost:1;
        /** tz_f0_ost : R/W; bitpos: [7]; default: 0;
         *  Configures whether or not event_f0 will trigger one-shot mode action.\\0:
         *  Disable\\1: Enable
         */
        uint32_t tz_f0_ost:1;
        /** tz_a_cbc_d : R/W; bitpos: [9:8]; default: 0;
         *  Configures cycle-by-cycle mode action on PWM$n A when fault event occurs and timer
         *  is decreasing.\\0: Do nothing\\1: Force low\\2: Force high\\3: Toggle
         */
        uint32_t tz_a_cbc_d:2;
        /** tz_a_cbc_u : R/W; bitpos: [11:10]; default: 0;
         *  Configures cycle-by-cycle mode action on PWM$n A when fault event occurs and timer
         *  is increasing.\\0: Do nothing\\1: Force low\\2: Force high\\3: Toggle
         */
        uint32_t tz_a_cbc_u:2;
        /** tz_a_ost_d : R/W; bitpos: [13:12]; default: 0;
         *  Configures one-shot mode action on PWM$n A when fault event occurs and timer is
         *  decreasing.\\0: Do nothing\\1: Force low\\2: Force high\\3: Toggle
         */
        uint32_t tz_a_ost_d:2;
        /** tz_a_ost_u : R/W; bitpos: [15:14]; default: 0;
         *  Configures one-shot mode action on PWM$n A when fault event occurs and timer is
         *  increasing.\\0: Do nothing\\1: Force low\\2: Force high\\3: Toggle
         */
        uint32_t tz_a_ost_u:2;
        /** tz_b_cbc_d : R/W; bitpos: [17:16]; default: 0;
         *  Configures cycle-by-cycle mode action on PWM$n B when fault event occurs and timer
         *  is decreasing.\\0: Do nothing\\1: Force low\\2: Force high\\3: Toggle
         */
        uint32_t tz_b_cbc_d:2;
        /** tz_b_cbc_u : R/W; bitpos: [19:18]; default: 0;
         *  Configures cycle-by-cycle mode action on PWM$n B when fault event occurs and timer
         *  is increasing.\\0: Do nothing\\1: Force low\\2: Force high\\3: Toggle
         */
        uint32_t tz_b_cbc_u:2;
        /** tz_b_ost_d : R/W; bitpos: [21:20]; default: 0;
         *  Configures one-shot mode action on PWM$n B when fault event occurs and timer is
         *  decreasing.\\0: Do nothing\\1: Force low\\2: Force high\\3: Toggle
         */
        uint32_t tz_b_ost_d:2;
        /** tz_b_ost_u : R/W; bitpos: [23:22]; default: 0;
         *  Configures one-shot mode action on PWM$n B when fault event occurs and timer is
         *  increasing.\\0: Do nothing\\1: Force low\\2: Force high\\3: Toggle
         */
        uint32_t tz_b_ost_u:2;
        uint32_t reserved_24:8;
    };
    uint32_t val;
} mcpwm_fh_cfg0_reg_t;

